import pytest


@pytest.fixture
def list_input():
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
    ]


@pytest.fixture
def sort_default():
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
    ]


@pytest.fixture
def transactions():
    return [
        {
            "id": 939719570,
            "state": "EXECUTED",
            "date": "2018-06-30T02:08:58.425572",
            "operationAmount": {
                "amount": "9824.07",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод организации",
            "from": "Счет 75106830613657916952",
            "to": "Счет 11776614605963066702",
        },
        {
            "id": 142264268,
            "state": "EXECUTED",
            "date": "2019-04-04T23:20:05.206878",
            "operationAmount": {
                "amount": "79114.93",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 19708645243227258542",
            "to": "Счет 75651667383060284188",
        },
        {
            "id": 873106923,
            "state": "EXECUTED",
            "date": "2019-03-23T01:09:46.296404",
            "operationAmount": {
                "amount": "43318.34",
                "currency": {"name": "руб.", "code": "RUB"},
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 44812258784861134719",
            "to": "Счет 74489636417521191160",
        },
        {
            "id": 895315941,
            "state": "EXECUTED",
            "date": "2018-08-19T04:27:37.904916",
            "operationAmount": {
                "amount": "56883.54",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод с карты на карту",
            "from": "Visa Classic 6831982476737658",
            "to": "Visa Platinum 8990922113665229",
        },
        {
            "id": 594226727,
            "state": "CANCELED",
            "date": "2018-09-12T21:27:25.241689",
            "operationAmount": {
                "amount": "67314.70",
                "currency": {"name": "руб.", "code": "RUB"},
            },
            "description": "Перевод организации",
            "from": "Visa Platinum 1246377376343588",
            "to": "Счет 14211924144426031657",
        },
    ]


@pytest.fixture
def list_USD():
    return [
        {
            "id": 939719570,
            "state": "EXECUTED",
            "date": "2018-06-30T02:08:58.425572",
            "operationAmount": {
                "amount": "9824.07",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод организации",
            "from": "Счет 75106830613657916952",
            "to": "Счет 11776614605963066702",
        },
        {
            "id": 142264268,
            "state": "EXECUTED",
            "date": "2019-04-04T23:20:05.206878",
            "operationAmount": {
                "amount": "79114.93",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод со счета на счет",
            "from": "Счет 19708645243227258542",
            "to": "Счет 75651667383060284188",
        },
        {
            "id": 895315941,
            "state": "EXECUTED",
            "date": "2018-08-19T04:27:37.904916",
            "operationAmount": {
                "amount": "56883.54",
                "currency": {"name": "USD", "code": "USD"},
            },
            "description": "Перевод с карты на карту",
            "from": "Visa Classic 6831982476737658",
            "to": "Visa Platinum 8990922113665229",
        },
    ]


@pytest.fixture
def start_num():
    return 1000000000000000


@pytest.fixture
def end_num():
    return 100000000000004


@pytest.fixture
def out_list_transaction():
    return [
        "31957.58",
        "8221.37 USD",
        "9824.07 USD",
        "48223.05",
        "79114.93 USD",
        "43318.34",
        "70946.18 USD",
        "51463.70 USD",
        "56883.54 USD",
        "79931.03",
        "40701.91 USD",
        "41096.24 USD",
        "67314.70",
        "77751.04",
        "50870.71",
        "3348.98 USD",
        "96995.73",
        "54280.01 USD",
        "90582.51 USD",
        "43861.89 USD",
        "67011.26",
        "7484.91 USD",
        "26334.08 USD",
        "49192.52 USD",
        "26971.25",
        "2631.44",
        "71771.90 USD",
        "45849.53 USD",
        "96900.90",
        "79428.73 USD",
        "90688.44 USD",
        "60888.63",
        "34380.08 USD",
        "77302.31 USD",
        "62621.51",
        "66263.93",
        "63150.74 USD",
        "23036.03",
        "21344.35",
        "98657.83",
        "30153.72",
        "978.31 USD",
        "51203.12 USD",
        "47022.09",
        "33249.01",
        "16872.46 USD",
        "31222.43",
        "2974.30 USD",
        "55985.82 USD",
        "19683.25 USD",
        "10083.68 USD",
        "621.37",
        "25762.92",
        "44493.45 USD",
        "52245.30 USD",
        "71024.64",
        "17628.50 USD",
        "2523.44",
        "18536.73",
        "82946.19",
        "29033.65 USD",
        "74604.56 USD",
        "62654.30 USD",
        "24260.78 USD",
        "22007.02 USD",
        "30234.99 USD",
        "19010.50",
        "37044.95",
        "56071.02",
        "47408.20 USD",
        "48150.39 USD",
        "73778.48",
        "62814.53",
        "95860.47",
        "81513.74",
        "65169.27 USD",
        "42210.20",
        "92130.50 USD",
        "90297.21",
        "66906.45 USD",
        "16796.95 USD",
        "84732.61",
        "6004.00",
        "37160.27",
        "45653.70",
        "74895.83",
        "69311.35",
        "82139.20",
        "91121.62",
        "60030.73 USD",
        "6357.56 USD",
        "96350.51 USD",
        "81150.87 USD",
        "56516.63 USD",
        "6381.58 USD",
        "991.49",
        "25780.71",
        "92688.46 USD",
        "87941.37",
        "97853.86",
    ]
